FujiNetWIFI/fujinet-firmware/lib/esp32-audioi2s/Audio.cpp
    ftyp -> moov -> udta -> meta -> ilst -> data

    __________________________________________________________________________________________________________________*/

    struct m4a_Atom{
        int  pos;
        int  size;
        char name[5];
    } atom, at, tmp;

    // c99 has no inner functions, lambdas are only allowed from c11, please don't use ancient compiler
    auto atomItems = [&](uint32_t startPos){    // lambda, inner function
        char tmp[5];
        audiofile.seek(startPos);
        audiofile.readBytes(tmp, 4);
        atom.size = bigEndian((uint8_t*)tmp, 4);
        if(!atom.size) atom.size = 4; // has no data, length is 0
        audiofile.readBytes(atom.name, 4);
        atom.name[4] = '\0';
        atom.pos = startPos;
        return atom;
    };
    // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    bool found      = false;
    uint32_t seekpos   = 0;
    uint32_t filesize  = getFileSize();
    char name[6][5]    = {"moov", "udta", "meta", "ilst"};
    const char info[12][6] = { "nam\0", "ART\0", "alb\0", "too\0",  "cmt\0",  "wrt\0",
                               "tmpo\0", "trkn\0","day\0", "cpil\0", "aART\0", "gen\0"};

    if(!audiofile) return; // guard

    at.pos = 0;
    at.size = filesize;
    seekpos = 0;

    for(int i = 0; i < 4; i++){
        found = false;
        while(seekpos < at.pos + at.size){
            tmp = atomItems(seekpos);
            seekpos += tmp.size;
            if(strcmp(tmp.name, name[i]) == 0) {memcpy((void*)&at, (void*)&tmp, sizeof(tmp)); found = true;}
 //           log_i("name %s pos %d, size %d", tmp.name, tmp.pos, tmp.size);
        }
        if(!found){
            Debug_println("m4a atom ilst not found");
            audiofile.seek(0);
            return;
        }
        seekpos = at.pos + 8; // 4 bytes size + 4 bytes name
    }

    int len = tmp.size - 8;
    if(len >1024) len = 1024;
//    log_i("found at pos %i, len %i", seekpos, len);

    uint8_t* data = (uint8_t*)malloc(len);
    if(!data){
        Debug_println("out od memory");
        audiofile.seek(0);
        return;
    }
    audiofile.seek(seekpos);
    audiofile.read(data, len);

    int offset;
    for(int i=0; i < 12; i++){
        offset = specialIndexOf(data, info[i], len, true);  // seek info[] with '\0'
        if(offset>0) {
            offset += 19; if(*(data + offset) == 0) offset ++;
            char value[256];
            size_t tmp = strlen((const char*)data + offset);
            if(tmp > 254) tmp = 254;
            memcpy(value, (data + offset), tmp);
            value[tmp] = 0;
            m_chbuf[0] = 0;
            if(i == 0)  sprintf(m_chbuf, "Title: %s", value);
            if(i == 1)  sprintf(m_chbuf, "Artist: %s", value);
            if(i == 2)  sprintf(m_chbuf, "Album: %s", value);
            if(i == 3)  sprintf(m_chbuf, "Encoder: %s", value);
            if(i == 4)  sprintf(m_chbuf, "Comment: %s", value);
            if(i == 5)  sprintf(m_chbuf, "Composer: %s", value);
            if(i == 6)  sprintf(m_chbuf, "BPM: %s", value);
            if(i == 7)  sprintf(m_chbuf, "Track Number: %s", value);
            if(i == 8)  sprintf(m_chbuf, "Year: %s", value);
            if(i == 9)  sprintf(m_chbuf, "Compile: %s", value);
            if(i == 10) sprintf(m_chbuf, "Album Artist: %s", value);
            if(i == 11) sprintf(m_chbuf, "Types of: %s", value);
            if(m_chbuf[0] != 0) {
                if(audio_id3data) audio_id3data(m_chbuf);
            }
        }
    }
    m_f_m4aID3dataAreRead = true;
    if(data) free(data);
    audiofile.seek(0);
    return;
}
//----------------------------------------------------------------------------------------------------------------------
void Audio::seek_m4a_stsz(){
    // stsz says what size each sample is in bytes. This is important for the decoder to be able to start at a chunk,
    // and then go through each sample by its size. The stsz atom can be behind the audio block. Therefore, searching
    // for the stsz atom is only applicable to local files.

    /* atom hierarchy (example)_________________________________________________________________________________________

    ftyp -> moov -> trak -> tkhd
            free    udta    mdia -> mdhd
            mdat                    hdlr
            mvhd                    minf -> smhd
                                            dinf
                                            stbl -> stsd
                                                    stts
                                                    stsc
                                                    stsz -> determine and return the position and number of entries
                                                    stco
    __________________________________________________________________________________________________________________*/

    struct m4a_Atom{
        int  pos;
        int  size;
        char name[5];
    } atom, at, tmp;

    // c99 has no inner functions, lambdas are only allowed from c11, please don't use ancient compiler
    auto atomItems = [&](uint32_t startPos){    // lambda, inner function
        char tmp[5];
        audiofile.seek(startPos);
        audiofile.readBytes(tmp, 4);
        atom.size = bigEndian((uint8_t*)tmp, 4);
        if(!atom.size) atom.size = 4; // has no data, length is 0
        audiofile.readBytes(atom.name, 4);
        atom.name[4] = '\0';
        atom.pos = startPos;
        return atom;
    };
    // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    bool found      = false;
    uint32_t seekpos   = 0;
    uint32_t filesize  = getFileSize();
    char name[6][5]    = {"moov", "trak", "mdia", "minf", "stbl", "stsz"};
    char noe[4];

    if(!audiofile) return; // guard

    at.pos = 0;
    at.size = filesize;
    seekpos = 0;

    for(int i = 0; i< 6; i++){
        found = false;
        while(seekpos < at.pos + at.size){
            tmp = atomItems(seekpos);
            seekpos += tmp.size;
            if(strcmp(tmp.name, name[i]) == 0) {memcpy((void*)&at, (void*)&tmp, sizeof(tmp)); found = true;}
            if(m_f_Log) Debug_printf("name %s pos %d, size %d\n", tmp.name, tmp.pos, tmp.size);
        }
        if(!found) goto noSuccess;
        seekpos = at.pos + 8; // 4 bytes size + 4 bytes name
    }

    seekpos += 8; // 1 byte version + 3 bytes flags + 4  bytes sample size
    audiofile.seek(seekpos);
    audiofile.readBytes(noe, 4); //number of entries
    m_stsz_numEntries = bigEndian((uint8_t*)noe, 4);
    if(m_f_Log) Debug_printf("number of entries in stsz: %d\n", m_stsz_numEntries);
    m_stsz_position = seekpos + 4;
    audiofile.seek(0);
    return;

noSuccess:
    m_stsz_numEntries= 0;
    m_stsz_position = 0;
    Debug_println("m4a atom stsz not found");
    audiofile.seek(0);
    return;
}
//----------------------------------------------------------------------------------------------------------------------
uint32_t Audio::m4a_correctResumeFilePos(uint32_t resumeFilePos){
    // In order to jump within an m4a file, the exact beginning of an aac block must be found. Since m4a cannot be
    // streamed, i.e. there is no syncword, an imprecise jump can lead to a crash.

